CSI API ETABS v1
cLoadCases.GetTypeOAPI Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTypeOAPI(
	string Name,
	ref eLoadCaseType CaseType,
	ref int SubType
)
Function GetTypeOAPI (
	Name As String,
	ByRef CaseType As eLoadCaseType,
	ByRef SubType As Integer
) As Integer
Dim instance As cLoadCases
Dim Name As String
Dim CaseType As eLoadCaseType
Dim SubType As Integer
Dim returnValue As Integer
returnValue = instance.GetTypeOAPI(Name,
	CaseType, SubType)
int GetTypeOAPI(
	String^ Name,
	eLoadCaseType% CaseType,
	int% SubType
)
abstract GetTypeOAPI :
        Name : string *
        CaseType : eLoadCaseType byref *
        SubType : int byref -> int
Parameters
Name
Type: System.String
CaseType
Type: ETABSv1.eLoadCaseType
SubType
Type: System.Int32
Return Value
Type: Int32
Remarks
See Also
Reference
cLoadCases Interface
ETABSv1 Namespace